/********************************************************************************
* 文件名称：	angle_sensor.h
* 作	者：	马如意   
* 当前版本：   	V1.0
* 完成日期：    2014.12.08
* 功能描述: 	定义angle_sensor.h头文件
* 历史信息：   
*           	版本信息     完成时间      原作者        注释
*
*       >>>>  在工程中的位置  <<<<
*          	  3-应用层
*          √  2-协议层
*             1-硬件驱动层
*********************************************************************************
* Copyright (c) 2014,天津华宁电子有限公司 All rights reserved.
*********************************************************************************/
#ifndef _ANGLE_SENSOR_H_
#define _ANGLE_SENSOR_H_
/********************************************************************************
* .h头文件
*********************************************************************************/
#include "includes.h"

/********************************************************************************
* #define宏定义
*********************************************************************************/
typedef enum
{
	SENSOR_AXIS_2 = 0x00,		//GUD90(B)采用2轴传感器		parry 2021.7.5
	SENSOR_AXIS_6 = 0x01		//GUD90(C)采用6轴传感器
}SENSOR_TYPE;
/********************************************************************************
* 常量定义
*********************************************************************************/
#define CANLEFT_REPORT_TIME_MIN				3000//数据上报的最小间隔，角度不变时，数据上报的最小间隔为3s  parry  2021.9.27
#define CANLEFT_PRG_SEND_TIMEOUT			30000//接收程序更新信息超时时间设置。30秒钟
//#define	ANGLESENSOR_POWERUP_TIME_SET		5000//上电之后的启动延时*1mS
#define	ANGLESENSOR_POWERUP_TIME_SET		3000//上电之后的启动延时*1mS
#define ANGLESENSOR_TASK_TIME_SET			10//任务的实际延时时间

#define STFRAME_LS_MAX						16//流水号的最大值

#define CANLEFT_HEARTTIMERMAX               250// 角度心跳时间

#define ALARM_HEARTTIMERMAX					400// 声光心跳时间

#define WLM_HEARTTIMERMAX					200// 无线模块心跳时间2s

/********************************************************************************
* 全局变量声明
*********************************************************************************/
extern SENSOR_TYPE	s_stSensorType;

extern u16 u16CanLeftLiuShuiNumb;
extern u16 u16CanLeftSendTimer;
extern u16 u16CanLeftSendInterval;
extern u16 u16CanLeftSystemRunStatus;
extern u32 u32CanLeftPrgRecvTimer;//接收程序计时器
/********************************************************************************
* 函数声明
*********************************************************************************/
void AngleSensor_Task(void *p_arg);
void AngleSensorMNG_Task(void *p_arg);
#endif

