/********************************************************************************
* 文件名称：	iwdg.c
* 作	者：	
* 当前版本：   	V1.0
* 完成日期：    2014.10.28
* 功能描述: 	完成看门狗初始化、喂狗等操作。
* 历史信息：   
*           	版本信息     完成时间      原作者        注释
*
*       >>>>  在工程中的位置  <<<<
*          	  3-应用层
*          √  2-协议层
*             1-硬件驱动层
*********************************************************************************
* Copyright (c) 2014,天津华宁电子有限公司 All rights reserved.
*********************************************************************************/
/********************************************************************************
* .h头文件
*********************************************************************************/
#include "includes.h"

/********************************************************************************
* #define宏定义
*********************************************************************************/

/********************************************************************************
* 常量定义
*********************************************************************************/
#define IWDG_TASK_INTERVAL		500//喂狗时间间隔,单位ms

/********************************************************************************
* 变量定义
*********************************************************************************/

/********************************************************************************
* 函数定义
*********************************************************************************/


/*******************************************************************************************
* 函数名称：IWDG_Configuration()
* 功能描述：看门狗外设初始化     
* 入口参数：无
* 出口参数：无
* 使用说明：初始化调用
*******************************************************************************************/
#ifdef IWDG_ENABLED
	void IWDG_Configuration(void)
	{
//		/* 使能寄存器 IWDG_PR 和 IWDG_RLR 写访问 */
//		IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
//		/* 看门狗分频时钟为: LSI/256 *//* 内部低速时钟256分频 40K/256=156HZ(6.4ms) */
//		IWDG_SetPrescaler(IWDG_Prescaler_256);
//		/* 设置看门狗的重载值.5S*//* 喂狗时间 5s/6.4MS=781 .注意不能大于0xfff*/
//		IWDG_SetReload(781);
//		/* 喂狗 */
//		IWDG_ReloadCounter();
//		/* 使能看门狗 */
//		IWDG_Enable();

		/* Check if the system has resumed from IWDG reset */
		if (rcu_flag_get(RCU_FLAG_FWDGTRST) != RESET)
		{		
			/* Clear reset flags */
			rcu_all_reset_flag_clear();
		}
		else
		{
			/* IWDGRST flag is not set */
		}
		/* Enable the LSI oscillator ************************************************/
		rcu_osci_on(RCU_IRC40K);
		/* Wait till LSI is ready */
		while (rcu_flag_get(RCU_FLAG_IRC40KSTB) == RESET)
		{}

		/* 
	   Enable write access to IWDG_PR and IWDG_RLR registers 
	   写入0x5555表示允许访问IWDG_PR 和IWDG_RLR寄存器 
		*/
		//IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
		fwdgt_write_enable();
		/* IWDG counter clock: LSI/256 */
		//	IWDG_SetPrescaler(IWDG_Prescaler_128);
		fwdgt_config(781, FWDGT_PSC_DIV256);

		/* Reload IWDG counter */
		//IWDG_ReloadCounter();
		fwdgt_counter_reload();
		/* Enable IWDG (the LSI oscillator will be enabled by hardware) */
		//IWDG_Enable();
		fwdgt_enable();
	}

/*******************************************************************************************
* 函数名称： IWDG_Feed()
* 功能描述：看门狗喂狗操作
* 入口参数：无
* 出口参数：无
* 使用说明：使能看门狗时调用
*******************************************************************************************/
	void IWDG_Feed(void)
	{
		//IWDG_ReloadCounter();
		fwdgt_counter_reload();
	}

/*******************************************************************************************
**函数名称：IWDG_task
**函数作用：看门狗主任务，实现周期性喂狗操作。
**函数参数：无
**函数输出：无
**注意事项：无
*******************************************************************************************/	
	void IWDG_Task(void *p_arg) 
	{ 
		IWDG_Configuration();
		//任务运行循环
		while(1)
		{
			IWDG_Feed();				//喂狗
			OSTimeDly(IWDG_TASK_INTERVAL);	//任务间隔500ms
		}
	}
#endif			//#ifdef IWDG_ENABLED

