
#include "randomapp.h"
#if INVOKED		//声明实际未被调用
RNG_HandleTypeDef sRngHandle;

/*******************************************************************************************
* 函数名称：void RNG_Init(void)
* 功能描述：RNG初始化函数
* 入口参数：无
* 出口参数：无
* 使用说明：无
********************************************************************************************/
void RNG_Init(void)
{
	sRngHandle.Instance = RNG;
	
	HAL_RNG_Init(&sRngHandle);
}

/*******************************************************************************************
* 函数名称：void HAL_RNG_MspInit(RNG_HandleTypeDef *hrng)
* 功能描述：
* 入口参数：无
* 出口参数：无
* 使用说明：无
********************************************************************************************/
void HAL_RNG_MspInit(RNG_HandleTypeDef *hrng)
{
	__HAL_RCC_RNG_CLK_ENABLE();
}

/*******************************************************************************************
* 函数名称：uint32_t RNG_Get_RandomNum(void)
* 功能描述：获取一个随机数
* 入口参数：无
* 出口参数：32位随机数
* 使用说明：无
********************************************************************************************/
uint32_t RNG_Get_RandomNum(void)
{
	 return HAL_RNG_GetRandomNumber(&sRngHandle);
}

/*******************************************************************************************
* 函数名称：uint16_t RNG_Get_RandomRange(uint16_t min, uint16_t max)
* 功能描述：获取一个区间随机数
* 入口参数：随机数区间范围
* 出口参数：16位随机数
* 使用说明：无
********************************************************************************************/
uint16_t RNG_Get_RandomRange(uint16_t min, uint16_t max)
{
	return HAL_RNG_GetRandomNumber(&sRngHandle)%(max-min+1) + min;
}
#endif

